#include<iostream>
#include<string>
#include<cmath>
using namespace std;
/*
Лаборторна робота №5 Задача№2
Напишіть програму, в якій оголошуються беззнакове коротке ціле Num і вказівник на нього  pNum.
Задайте адресу цілого вказівнику.
Виведіть на екран значення змінних і адреси кожної змінної у шістнадцятиричній і десятковій системі числення. 
Порівняйте отримані результати. Зробіть висновки.
*/
int main() {
	int Num = 7;
	int *pNum = &Num;
	cout << Num << "\t" << &Num << "\t" << "\t" << "$" << endl;
	cout << "$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$" << endl;
	*pNum = 3;
	cout << *pNum << "\t" << pNum <<  "\t" << "\t" << "$" << endl;
	cout << "$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$" << endl;
	return 0; 
}

