#include<iostream>
#include<string>
#include<cmath>
using namespace std;
/*
Лабораторная №6 Задача№4
Опишіть три функції:
1) яка створює об'єкт цілого типу у вільній пам'яті і повертає в якості результату цей об'єкт. Перевірте її.
2) яка створює об'єкт цілого типу у вільній пам'яті і повертає в якості результату посилання на об'єкт. Перевірте її.
3) яка створює об'єкт цілого типу у вільній пам'яті і повертає в якості результату адресу об'єкта. Перевірте її.
Перевірте, чи можна описати аналогічні функції, якщо об’єкт створюється у стеку.Зробіть висновок.
*/
int aa(int b);
int ab(int &b);
int ac(int *b);
int main() {
	int b;
	cin >> b;
	cout << aa(b) <<
	return 0;
}
int aa(int b) {
	int *p = new int(b);
	return *p;
}
int ab(int &b) {
	int *p = new int(b);
	return *p;
}
int ac(int *b) {
	int *p = new int(*b);
	return *p;
}
